Revit 2027 API
RebarGeometryType Enumeration
 Rebar geometry type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarGeometryType
Public Enumeration RebarGeometryType
public enum class RebarGeometryType
type RebarGeometryType
Members
Member name | Value | Description
FreeForm | 1 |  Free Form.
ShapeBased | 0 |  Shape Driven.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace